ARMmbed/mbed-os/libraries/mbed/targets/hal/TARGET_Silicon_Labs/TARGET_EFM32/serial_api.c
    obj->serial.dmaOptionsRX.dmaChannel = -1;
    obj->serial.dmaOptionsRX.dmaUsageState = DMA_USAGE_OPPORTUNISTIC;

}

void serial_free(serial_t *obj)
{
    if( LEUART_REF_VALID(obj->serial.periph.leuart) ) {
        LEUART_Enable(obj->serial.periph.leuart, leuartDisable);
    } else {
        USART_Enable(obj->serial.periph.uart, usartDisable);
    }

#ifdef _SILICON_LABS_32B_PLATFORM_2
    serial_uart_free(obj->serial.periph.uart);
#endif
}

static void serial_enable(serial_t *obj, uint8_t enable)
{
    if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
        if (enable) {
            LEUART_Enable(obj->serial.periph.leuart, leuartEnable);
        } else {
            LEUART_Enable(obj->serial.periph.leuart, leuartDisable);
        }
    } else {
        if (enable) {
            USART_Enable(obj->serial.periph.uart, usartEnable);
        } else {
            USART_Enable(obj->serial.periph.uart, usartDisable);
        }
    }
    serial_irq_ids[serial_get_index(obj)] = 0;
}

/**
 * Set UART baud rate
 */
void serial_baud(serial_t *obj, int baudrate)
{
    if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
#ifndef _SILICON_LABS_32B_PLATFORM_2
#ifdef LEUART_USING_LFXO

        /* check if baudrate is within allowed range */
        MBED_ASSERT(baudrate >= (LEUART_LF_REF_FREQ >> 7));

        if(baudrate > (LEUART_LF_REF_FREQ >> 1)){
            /* check if baudrate is within allowed range */
            MBED_ASSERT((baudrate <= (LEUART_HF_REF_FREQ >> 1)) && (baudrate > (LEUART_HF_REF_FREQ >> 10)));

            CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_CORELEDIV2);
            uint8_t divisor = 1;

            if(baudrate > (LEUART_HF_REF_FREQ >> 7)){
                divisor = 1;
            }else if(baudrate > (LEUART_HF_REF_FREQ >> 8)){
                divisor = 2;
            }else if(baudrate > (LEUART_HF_REF_FREQ >> 9)){
                divisor = 4;
            }else{
                divisor = 8;
            }
            CMU_ClockDivSet(serial_get_clock(obj), divisor);
            LEUART_BaudrateSet(obj->serial.periph.leuart, LEUART_HF_REF_FREQ/divisor, (uint32_t)baudrate);
        }else{
            CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_LFXO);
            CMU_ClockDivSet(serial_get_clock(obj), 1);
            LEUART_BaudrateSet(obj->serial.periph.leuart, LEUART_LF_REF_FREQ, (uint32_t)baudrate);
        }
#else
        /* check if baudrate is within allowed range */
        MBED_ASSERT((baudrate > (LEUART_REF_FREQ >> 10)) && (baudrate <= (LEUART_REF_FREQ >> 1)));
        uint8_t divisor = 1;
        if(baudrate > (LEUART_REF_FREQ >> 7)){
            divisor = 1;
        }else if(baudrate > (LEUART_REF_FREQ >> 8)){
            divisor = 2;
        }else if(baudrate > (LEUART_REF_FREQ >> 9)){
            divisor = 4;
        }else{
            divisor = 8;
        }
        CMU_ClockDivSet(serial_get_clock(obj), divisor);
        LEUART_BaudrateSet(obj->serial.periph.leuart, LEUART_REF_FREQ/divisor, (uint32_t)baudrate);
#endif
#else
        /* For Pearl, we must check if we need to upgrade to using a standard USART */
        if( baudrate > SERIAL_LEUART_MAX_BAUDRATE ) {
            serial_switch_to_usart(obj, baudrate);
        } else {
            LEUART_BaudrateSet(obj->serial.periph.leuart, LEUART_LF_REF_FREQ, (uint32_t)baudrate);
        }
#endif
    } else {
        USART_BaudrateAsyncSet(obj->serial.periph.uart, 0, (uint32_t)baudrate, usartOVS16);
    }
}

#ifdef _SILICON_LABS_32B_PLATFORM_2
/**
 * Deinit LEUART, and allocate and init an USART on the same pins with
 * the same configuration.
 */
static void serial_switch_to_usart(serial_t *obj, int baudrate)
{
    LEUART_TypeDef *leuart = obj->serial.periph.leuart;

    while(leuart->SYNCBUSY & LEUART_SYNCBUSY_CMD);

    /* Grab all relevant status */
    uint32_t ien_rxd  = leuart->IEN & LEUART_IEN_RXDATAV;
    uint32_t ien_txc  = leuart->IEN & LEUART_IEN_TXC;
    uint32_t ien_ferr = leuart->IEN & LEUART_IEN_FERR;
    uint32_t ien_perr = leuart->IEN & LEUART_IEN_PERR;
    uint32_t ien_rxof = leuart->IEN & LEUART_IEN_RXOF;

    uint32_t parity    = leuart->CTRL & _LEUART_CTRL_PARITY_MASK;
    uint32_t stop_bits = leuart->CTRL & _LEUART_CTRL_STOPBITS_MASK;

    uint32_t irq_id = serial_irq_ids[serial_get_index(obj)];

    /* Disable LEUART */
    serial_enable(obj, false);

    /* Remove IRQ callback */
    serial_irq_ids[serial_get_index(obj)] = 0;

    /* Free DMA channels */
    if( obj->serial.dmaOptionsTX.dmaChannel != -1 )
        dma_channel_free(obj->serial.dmaOptionsTX.dmaChannel);

    if( obj->serial.dmaOptionsRX.dmaChannel != -1 )
        dma_channel_free(obj->serial.dmaOptionsRX.dmaChannel);

    obj->serial.dmaOptionsTX.dmaChannel = -1;
    obj->serial.dmaOptionsTX.dmaUsageState = DMA_USAGE_OPPORTUNISTIC;
    obj->serial.dmaOptionsRX.dmaChannel = -1;
    obj->serial.dmaOptionsRX.dmaUsageState = DMA_USAGE_OPPORTUNISTIC;

    /* TODO: disable clocks? */

    /* Disable sleep */
    uint32_t sleep_count = obj->serial.sleep_blocked;
    while( obj->serial.sleep_blocked > 0 )
        serial_unblock_sleep(obj);

    SerialParity par = ParityNone;
    switch( parity ) {
        case LEUART_CTRL_PARITY_NONE: par = ParityNone; break;
        case LEUART_CTRL_PARITY_EVEN: par = ParityEven; break;
        case LEUART_CTRL_PARITY_ODD:  par = ParityOdd;  break;
        default:
            MBED_ASSERT(0);
            break;
    }

    int stopb = 1;
    switch( stop_bits ) {
        case LEUART_CTRL_STOPBITS_ONE: stopb = 1; break;
        case LEUART_CTRL_STOPBITS_TWO: stopb = 2; break;
        default:
            MBED_ASSERT(0);
            break;
    }

    /* Replace LEUART with USART */
    serial_preinit(obj, obj->serial.tx_pin, obj->serial.rx_pin, false);
    CMU_ClockEnable(serial_get_clock(obj), true);
    uart_init(obj, baudrate, par, stopb);

    USART_TypeDef *usart = obj->serial.periph.uart;

    /* Disable/enable routing */
    usart->ROUTELOC0 = (obj->serial.location_tx << _USART_ROUTELOC0_TXLOC_SHIFT) |
                       (obj->serial.location_rx << _USART_ROUTELOC0_RXLOC_SHIFT);
    leuart->ROUTEPEN = 0;
    usart->ROUTEPEN = USART_ROUTEPEN_RXPEN | USART_ROUTEPEN_TXPEN;
    usart->IFC = USART_IFC_TXC;

